Revit 2015 API
ReinforcementSettings.RebarShapeDefinesHooks Property
 Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public bool RebarShapeDefinesHooks { get; set; }
Visual Basic
Public Property RebarShapeDefinesHooks As Boolean
	Get
	Set
Visual C++
public:
property bool RebarShapeDefinesHooks {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: the document contains one or more Rebar elements. -or- When setting this property: the document contains one or more AreaReinforcement or PathReinforcement elements.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace